//=============================================================================
//
// チュートリアルクラス [tutorial.cpp]
// Author : Konishi Yuuto
//
//=============================================================================

//====================================================================
// インクルード
//====================================================================
#include "tutorial.h"
#include "renderer.h"
#include "manager.h"
#include "texture.h"

//====================================================================
// ポリゴン生成
//====================================================================
CTutorial * CTutorial::Create(D3DXVECTOR3 pos, D3DXVECTOR3 size, TYPE type)
{
	// インスタンス生成
	CTutorial *pTutorial = new CTutorial;

	if (pTutorial != NULL)
	{
		// 初期化処理
		pTutorial->Init(pos, size, type);

		// テクスチャの設定
		pTutorial->BindTexture(CTexture::GetTexture(CTexture::TEXTURE_NUM_TUTORIAL));
	}
	return pTutorial;
}

//====================================================================
// コンストラクタ
//====================================================================
CTutorial::CTutorial() : CScene2D(TYPE_UI)
{

}

//====================================================================
// デストラクタ
//====================================================================
CTutorial::~CTutorial()
{
}

//====================================================================
// 初期化処理
//====================================================================
HRESULT CTutorial::Init(D3DXVECTOR3 pos, D3DXVECTOR3 size, TYPE type)
{
	// 初期化処理
	CScene2D::Init(pos, size, type);

	return S_OK;
}

//====================================================================
// 終了処理
//====================================================================
void CTutorial::Uninit(void)
{
	// 終了処理
	CScene2D::Uninit();
	Release();
}

//====================================================================
// 更新処理
//====================================================================
void CTutorial::Update(void)
{
	// 更新処理
	CScene2D::Update();
}

//====================================================================
// 描画処理
//====================================================================
void CTutorial::Draw(void)
{
	// 描画処理
	CScene2D::Draw();
}