//=============================================================================
//
// UIクラス [ui.cpp]
// Author : Konishi Yuuto
//
//=============================================================================

//=============================================================================
// インクルード
//=============================================================================
#include "ui.h"
#include "renderer.h"
#include "manager.h"
#include "sound.h"
#include "texture.h"

//=============================================================================
// インスタンス生成
//=============================================================================
CUi * CUi::Create(D3DXVECTOR3 pos, D3DXVECTOR3 size, TYPE type, UI_TYPE Utype)
{
	// インスタンス生成
	CUi *pUi = new CUi;

	if (pUi != NULL)
	{
		// 初期化処理
		pUi->Init(pos, size, type);

		switch (Utype)
		{
		case UI_TYPE_WALL:
			// テクスチャ
			pUi->BindTexture(CTexture::GetTexture(CTexture::TEXTURE_NUM_UI_WALL));
			break;

		case UI_TYPE_WAKU:
			// テクスチャ
			pUi->BindTexture(CTexture::GetTexture(CTexture::TEXTURE_NUM_UI_WAKU));
			pUi->InitScroll(1, 0.04f);
			break;

		case UI_TYPE_REMAIN:
			// テクスチャ
			pUi->BindTexture(CTexture::GetTexture(CTexture::TEXTURE_NUM_UI_REMAIN));
			break;
		}
	}
	return pUi;
}

//=============================================================================
// コンストラクタ
//=============================================================================
CUi::CUi(TYPE Priority) : CScene2D(Priority)
{
	m_Pos = D3DXVECTOR3(0.0f, 0.0f, 0.0f);
	m_move = D3DXVECTOR3(0.0f, 0.0f, 0.0f);
	m_Utype = UI_TYPE_NONE;
}

//=============================================================================
// デストラクタ
//=============================================================================
CUi::~CUi()
{

}

//=============================================================================
// 初期化処理
//=============================================================================
HRESULT CUi::Init(D3DXVECTOR3 pos, D3DXVECTOR3 size, TYPE type)
{
	// 初期化処理
	CScene2D::Init(pos, size, type);

	return S_OK;
}

//=============================================================================
// 終了処理
//=============================================================================
void CUi::Uninit(void)
{
	// 2Dポリゴン終了処理
	CScene2D::Uninit();

	Release();
}

//=============================================================================
// 更新処理
//=============================================================================
void CUi::Update(void)
{
	// 2Dポリゴン更新処理
	CScene2D::Update();
}

//=============================================================================
// 描画処理
//=============================================================================
void CUi::Draw(void)
{
	// 2Dポリゴン描画処理
	CScene2D::Draw();
}

//=============================================================================
// Uiのタイプを設定
//=============================================================================
void CUi::SetType(UI_TYPE Utype)
{
	m_Utype = Utype;
}